app/views/orders/_form.html.erb

SELECT "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    <div id="error_explanation">
      <h2><%=raw t('errors.template.header', count: @order.errors.count,
      model: t('activerecord.models.order')) %>.</h2>