app/controllers/line_items_controller.rb

  def create
    product = Product.find(params[:product_id])
    @line_item = @cart.add_product(product)

    respond_to do |format|
      if @line_item.save
---
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2020-07-15 08:25:45.810930"], ["updated_at", "2020-07-15 08:25:45.810930"]]

  def update
    respond_to do |format|
      if @line_item.update(line_item_params)
---
UPDATE "line_items" SET "product_id" = ?, "updated_at" = ? WHERE "line_items"."id" = ?  [["product_id", 298486374], ["updated_at", "2020-07-15 08:13:24.090472"], ["id", 298486374]]