app/controllers/orders_controller.rb

INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2020-07-15 10:08:29.364415"], ["updated_at", "2020-07-15 10:08:29.364415"]]
INSERT INTO "orders" ("name", "address", "email", "pay_type", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "KHanh"], ["address", "222222"], ["email", "01673khanh@gmail.com"], ["pay_type", 1], ["created_at", "2020-07-17 02:36:26.247497"], ["updated_at", "2020-07-17 02:36:26.247497"]]
DELETE FROM "carts" WHERE "carts"."id" = ?  [["id", 76]]
---
  def create
    @order = Order.new(order_params)
    @order.add_line_items_from_cart(@cart)

    respond_to do |format|
      if @order.save
       Cart.destroy(session[:cart_id])

UPDATE "orders" SET "pay_type" = ?, "updated_at" = ? WHERE "orders"."id" = ?  [["pay_type", 0], ["updated_at", "2020-07-10 16:10:56.066113"], ["id", 4]]
---
  def update
    respond_to do |format|
      if @order.update(order_params)

DELETE FROM "orders" WHERE "orders"."id" = ?  [["id", 17]]
---
  def destroy
    @order.destroy

SELECT "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 17], ["LIMIT", 1]]
---
    def set_order
      @order = Order.find(params[:id])

SELECT 1 AS one FROM "line_items" WHERE "line_items"."cart_id" = ? LIMIT ?  [["cart_id", 80], ["LIMIT", 1]]
---
     def ensure_cart_isnt_empty
       if @cart.line_items.empty?