app/controllers/products_controller.rb

SELECT "products".* FROM "products" ORDER BY "products"."title" ASC LIMIT ? OFFSET ?  [["LIMIT", 30], ["OFFSET", 0]]
---
  def index
    @products = Product.all.order(:title).paginate(page: params[:page])

INSERT INTO "products" ("title", "description", "image_url", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save

UPDATE "products" SET "title" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["title", "Điện Thoại Samsung Galaxy Note 10 Lite (128GB/8GB)"], ["updated_at", "2020-07-08 10:06:50.895745"], ["id", 4]]
---
  def update
    respond_to do |format|
      if @product.update(product_params)

DELETE FROM "products" WHERE "products"."id" = ?  [["id", 3]]
---
  def destroy
    @product.destroy

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def who_bought
    @product = Product.find(params[:id])

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
  def set_product
    @product = Product.find(params[:id])