app/views/layouts/application.html.erb

              <div id="cart" class ="carts">
                <%= render_if @cart && @cart.line_items.any?, @cart %>
---
SELECT 1 AS one FROM "line_items" WHERE "line_items"."cart_id" = ? LIMIT ?  [["cart_id", 80], ["LIMIT", 1]]